Repository: Moknahio/Moknah-ATS
Catalog: languages/ats-moknah-*.po
Languages: ar

source: Failed to load voices. Please check your API key and try again.
ar: فشل تحميل الأصوات. يرجى التحقق من مفتاح API والمحاولة مرة أخرى.

source: You do not have permission to test email settings.
ar: ليس لديك صلاحية لاختبار إعدادات البريد الإلكتروني.

source: Security verification failed. Please refresh the page and try again.
ar: فشل التحقق الأمني. يرجى تحديث الصفحة والمحاولة مرة أخرى.

source: [%s] Email Test - ATS Moknah
ar: [%s] اختبار البريد الإلكتروني - ATS Moknah

source: This is a test email from ATS Moknah plugin. Site: %s Site URL: %s Sent to: %s Sent at: %s If you received this email, your WordPress email configuration is working correctly. Email notifications will be sent when: • Audio generation completes successfully • Audio generation fails (if enabled) You can configure notification preferences in the ATS Moknah settings. --- ATS Moknah Plugin Test Email
ar: هذا بريد إلكتروني تجريبي من إضافة ATS Moknah. الموقع: %s رابط الموقع: %s أُرسل إلى: %s تاريخ الإرسال: %s إذا وصلك هذا البريد، فهذا يعني أن إعدادات البريد في ووردبريس تعمل بشكل صحيح. سيتم إرسال الإشعارات في الحالات التالية: • عند اكتمال توليد الصوت بنجاح • عند فشل توليد الصوت (إذا كان مفعّلًا) يمكنك ضبط إعدادات الإشعارات من صفحة إعدادات ATS Moknah. --- بريد اختبار إضافة ATS Moknah

source: Unknown error
ar: خطأ غير معروف

source: Failed to send test email. Error: %s. Please check your email configuration. %s
ar: فشل إرسال البريد التجريبي. الخطأ: %s. يرجى التحقق من إعدادات البريد الإلكتروني. %s

source: Test email sent successfully to %s. Please check your inbox (and spam folder).
ar: تم إرسال البريد التجريبي بنجاح إلى %s. يرجى التحقق من صندوق الوارد (وأيضًا مجلد الرسائل غير المرغوب فيها).

source: Your server may not be configured to send emails.
ar: قد لا يكون الخادم مهيأً لإرسال البريد الإلكتروني.

source: Try installing an SMTP plugin like "WP Mail SMTP" or "Easy WP SMTP".
ar: جرّب تثبيت إضافة SMTP مثل "WP Mail SMTP" أو "Easy WP SMTP".

source: Contact your hosting provider to verify email sending is enabled.
ar: تواصل مع شركة الاستضافة للتأكد من أن إرسال البريد الإلكتروني مفعّل.

source: You do not have permission to generate audio for posts.
ar: ليس لديك صلاحية توليد الصوت للمقالات.

source: Invalid post ID provided.
ar: تم تمرير رقم مقال غير صالح.

source: Post not found. It may have been deleted.
ar: المقال غير موجود. قد يكون قد تم حذفه.

source: Unable to load available voices. Please check your API key in settings.
ar: تعذر تحميل الأصوات المتاحة. يرجى التحقق من مفتاح API في الإعدادات.

source: Selected voice is not available. Please choose a different voice.
ar: الصوت المحدد غير متاح. يرجى اختيار صوت آخر.

source: Please enable Text-to-Speech before generating audio.
ar: يرجى تفعيل تحويل النص إلى كلام قبل توليد الصوت.

source: API key not configured. Please add your Moknah API key in settings.
ar: مفتاح API غير مهيأ. يرجى إضافة مفتاح Moknah API في الإعدادات.

source: Post content is empty. Please add content before generating audio.
ar: محتوى المقال فارغ. يرجى إضافة محتوى قبل توليد الصوت.

source: Post content is too short. Please add at least 50 characters of content.
ar: محتوى المقال قصير جدًا. يرجى إضافة ما لا يقل عن 50 حرفًا.

source: Audio generation started. Notifications to post author are disabled.
ar: بدأ توليد الصوت. تم تعطيل الإشعارات لكاتب المقال.

source: Audio generation started successfully. Notifications to post author are disabled.
ar: تم بدء توليد الصوت بنجاح. إشعارات كاتب المقال معطلة.

source: Audio generation started successfully. You will be notified when it's ready.
ar: تم بدء توليد الصوت بنجاح. سيتم إشعارك عند الانتهاء.

source: ATS Options
ar: خيارات ATS

source: API Key Required:
ar: مفتاح API مطلوب:

source: Please configure your Moknah API key in %s first.
ar: يرجى إعداد مفتاح Moknah API في %s أولًا.

source: settings
ar: الإعدادات

source: No Voices Available:
ar: لا توجد أصوات متاحة:

source: Generation Failed:
ar: فشل التوليد:

source: Enable Text-to-Speech
ar: تفعيل تحويل النص إلى كلام

source: Enable AI Preprocessing
ar: تفعيل المعالجة المسبقة بالذكاء الاصطناعي

source: Voice
ar: الصوت

source: Select a voice
ar: اختر صوتًا

source: No voices available
ar: لا توجد أصوات متاحة

source: Voice Sample
ar: عينة الصوت

source: Generated Audio
ar: الصوت المُولّد

source: Status
ar: الحالة

source: Generate Audio
ar: توليد الصوت

source: Regenerate Audio
ar: إعادة توليد الصوت

source: Settings saved successfully.
ar: تم حفظ الإعدادات بنجاح.

source: ATS Moknah Settings
ar: إعدادات ATS Moknah

source: Configure your Article to Speech settings and default preferences.
ar: قم بضبط إعدادات تحويل المقال إلى صوت والتفضيلات الافتراضية.

source: Warning:
ar: تحذير:

source: Unable to load voices from Moknah API. Please verify your API key is correct and has the necessary permissions.
ar: تعذر تحميل الأصوات من واجهة Moknah API. يرجى التأكد من صحة مفتاح API وامتلاكه الصلاحيات اللازمة.

source: API Configuration
ar: إعدادات API

source: Moknah API Key
ar: مفتاح Moknah API

source: Enter your Moknah API key to enable text-to-speech conversion.
ar: أدخل مفتاح Moknah API لتفعيل تحويل النص إلى كلام.

source: Enter your API key
ar: أدخل مفتاح API

source: Article Selector
ar: محدد المقال

source: Skipped Selectors
ar: المحددات المتجاهلة

source: Callback url
ar: رابط Callback

source: ( optional )
ar: ( اختياري )

source: Voice Settings
ar: إعدادات الصوت

source: Default Voice
ar: الصوت الافتراضي

source: Notification Settings
ar: إعدادات الإشعارات

source: Email Notifications
ar: إشعارات البريد الإلكتروني

source: Notify post author when audio is ready
ar: إشعار كاتب المقال عند جاهزية الصوت

source: Notify site administrator
ar: إشعار مدير الموقع

source: Send notifications for failed generations
ar: إرسال إشعارات عند فشل التوليد

source: Test Email Configuration
ar: اختبار إعدادات البريد الإلكتروني

source: Send Test Email
ar: إرسال بريد تجريبي

source: The test email will be sent to: %s
ar: سيتم إرسال البريد التجريبي إلى: %s

source: Save Settings
ar: حفظ الإعدادات

source: Listen to the article
ar: استمع إلى المقال هنا

source: Enter the innermost CSS selector that directly contains the post title and body.
ar: أدخل محدد CSS الأعمق الذي يحتوي مباشرةً على عنوان المقال ومحتواه.

source: A list of CSS selectors inside "Article Selector" which you plan to ignore them from being highlighted
ar: قائمة بمحددات CSS داخل "محدد المقال" التي تخطط لتجاهلها وعدم تمييزها.

source: '.highlighter-skip' Selector is included by default
ar: المحدد '.highlighter-skip' مُضمَّن افتراضيًا.

source: Enter the callback URL to receive audio file notifications.
ar: أدخل رابط الاستدعاء (Callback URL) لاستلام إشعارات ملفات الصوت.

source: Select the default voice for new articles.
ar: اختر الصوت الافتراضي للمقالات الجديدة.

source: Choose who receives notifications when audio generation completes.
ar: اختر من يتلقى الإشعارات عند اكتمال إنشاء الصوت.

source: Send a test email to verify your WordPress email setup is working correctly.
ar: أرسل بريدًا تجريبيًا للتحقق من أن إعداد البريد في ووردبريس يعمل بشكل صحيح.
